Revit 2026 API

# DistributionSysTypeSetErase Method

---

Removes a specified DistributionSys type from the set.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual int Erase(
	DistributionSysType item
)
```
```vb
Public Overridable Function Erase (
	item As DistributionSysType
) As Integer
```
```cpp
public:
virtual int Erase(
	DistributionSysType^ item
)
```
```fsharp
abstract Erase :
        item : DistributionSysType -> int
override Erase :
        item : DistributionSysType -> int
```

#### Parameters

item DistributionSysType
    The DistributionSys type to be erased.

#### Return Value

Int32The number of DistributionSys types that were erased from the set.

#### Reference

DistributionSysTypeSet Class

Autodesk.Revit.DB.Electrical Namespace